virusdefender/pocsag_receiver/firmware/ebyte-e32/include/stm32f1xx_hal_conf.h
#ifndef __STM32F1XX_HAL_CONF_H
#define __STM32F1XX_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f1xx_hal.h"

#define HSE_VALUE 8000000U
#define HSI_VALUE 8000000U
#define LSE_VALUE 32768U
#define LSI_VALUE 40000U

#define HAL_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
#define HAL_SPI_MODULE_ENABLED

#define TICK_INT_PRIORITY 0x0F

#ifdef __cplusplus
}
#endif

#endif
